import sys
import os
args = sys.argv

# 変換テーブル
hira2bin = {
    '\"':'', # " は削除
    'ー':'2D', # 'ー' は ハイフン'-' に変換
    '　':'20', '！':'21', '＂':'22', '＃':'23', '＄':'24', '％':'25', '＆':'26', '＇':'27',
    '（':'28', '）':'29', '＊':'2A', '＋':'2B', '，':'2C', '－':'2D', '．':'2E', '／':'2F',
    '０':'30', '１':'31', '２':'32', '３':'33', '４':'34', '５':'35', '６':'36', '７':'37',
    '８':'38', '９':'39', '：':'3A', '；':'3B', '＜':'3C', '＝':'3D', '＞':'3E', '？':'3F',
    '＠':'40', 'Ａ':'41', 'Ｂ':'42', 'Ｃ':'43', 'Ｄ':'44', 'Ｅ':'45', 'Ｆ':'46', 'Ｇ':'47',
    'Ｈ':'48', 'Ｉ':'49', 'Ｊ':'4A', 'Ｋ':'4B', 'Ｌ':'4C', 'Ｍ':'4D', 'Ｎ':'4E', 'Ｏ':'4F',
    'Ｐ':'50', 'Ｑ':'51', 'Ｒ':'52', 'Ｓ':'53', 'Ｔ':'54', 'Ｕ':'55', 'Ｖ':'56', 'Ｗ':'57',
    'Ｘ':'58', 'Ｙ':'59', 'Ｚ':'5A', '［':'5B', '￥':'5C', '］':'5D', '＾':'5E', '＿':'5F',
    '｀':'60', 'ａ':'61', 'ｂ':'62', 'ｃ':'63', 'ｄ':'64', 'ｅ':'65', 'ｆ':'66', 'ｇ':'67',
    'ｈ':'68', 'ｉ':'69', 'ｊ':'6A', 'ｋ':'6B', 'ｌ':'6C', 'ｍ':'6D', 'ｎ':'6E', 'ｏ':'6F',
    'ｐ':'70', 'ｑ':'71', 'ｒ':'72', 'ｓ':'73', 'ｔ':'74', 'ｕ':'75', 'ｖ':'76', 'ｗ':'77',
    'ｘ':'78', 'ｙ':'79', 'ｚ':'7A', '｛':'7B', '｜':'7C', '｝':'7D', '～':'7E', '＼':'7F',
               'ぁ':'81', 'あ':'82', 'ぃ':'83', 'い':'84', 'ぅ':'85', 'う':'86', 'ぇ':'87',
    'え':'88', 'ぉ':'89', 'お':'8A', 'か':'8B', 'が':'8C', 'き':'8D', 'ぎ':'8E', 'く':'8F',
    'ぐ':'90', 'け':'91', 'げ':'92', 'こ':'93', 'ご':'94', 'さ':'95', 'ざ':'96', 'し':'97',
    'じ':'98', 'す':'99', 'ず':'9A', 'せ':'9B', 'ぜ':'9C', 'そ':'9D', 'ぞ':'9E', 'た':'9F',
    'だ':'A0', 'ち':'A1', 'ぢ':'A2', 'っ':'A3', 'つ':'A4', 'づ':'A5', 'て':'A6', 'で':'A7',
    'と':'A8', 'ど':'A9', 'な':'AA', 'に':'AB', 'ぬ':'AC', 'ね':'AD', 'の':'AE', 'は':'AF',
    'ば':'B0', 'ぱ':'B1', 'ひ':'B2', 'び':'B3', 'ぴ':'B4', 'ふ':'B5', 'ぶ':'B6', 'ぷ':'B7',
    'へ':'B8', 'べ':'B9', 'ぺ':'BA', 'ほ':'BB', 'ぼ':'BC', 'ぽ':'BD', 'ま':'BE', 'み':'BF',
    'む':'C0', 'め':'C1', 'も':'C2', 'ゃ':'C3', 'や':'C4', 'ゅ':'C5', 'ゆ':'C6', 'ょ':'C7',
    'よ':'C8', 'ら':'C9', 'り':'CA', 'る':'CB', 'れ':'CC', 'ろ':'CD', 'ゎ':'CE', 'わ':'CF',
    'ゐ':'D0', 'ゑ':'D1', 'を':'D2', 'ん':'D3',
}

# ファイルを変換。"***.txt" → "***.1.txt" に出力
def convert():
    # 読み込み[書き込み] ファイル名の指定
    inputpath = args[1]
    root ,ext = os.path.splitext(inputpath)
    outputpath = root + ".1" + ext

    # 変換テーブル作成
    table = str.maketrans(hira2bin)

    # 読み込み
    inputfile = open(inputpath, "r", encoding="utf-8")
    lines = inputfile.readlines()
    inputfile.close()

    # 書き込み
    out = ""

    for line in lines:
        if ".!hira" in line: # ".!hira" という文字列が存在する行に対してのみ処理を行う
            line = line.replace('.!hira', '.hex')
            out += line.translate(table)
        else:
            out += line

    # 保存
    outputfile = open(outputpath, "w", encoding="utf-8")
    outputfile.write(out)
    outputfile.close()

# 変換テーブルを出力
def make_hira2bin_dic():
    # ■ ASCII部 変換テーブル作成スクリプト
    #   参考 : https://qiita.com/YuukiMiyoshi/items/6ce77bf402a29a99f1bf

    # 変換テーブル
    # !\"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ\^_`abcdefghijklmnopqrstuvwxyz{|}~
    trans_dic = { chr(0x0020+i) : chr(0xFF00+i) for i in range(0x60) }
    trans_tbl = str.maketrans(trans_dic)

    # 変換
    for i in range(0x60):
        hex = 0x20 + i
        c = chr(hex).translate(trans_tbl)
        print(f"'{c}':'{hex:2X}', ", end="")
        if not ((i+1)%8):
            print()
    
    # 変換テーブル (日本語)
    trans_dic = { chr(0x3040+i) : chr(0x3040+i) for i in range(0x54) }
    trans_tbl = str.maketrans(trans_dic)

    # 変換 (日本語)
    for i in range(0x54):
        hex = 0x80 + i
        c = chr(hex + 0x3040 - 0x80).translate(trans_tbl)
        print(f"'{c}':'{hex:2X}', ", end="")
        if not ((i+1)%8):
            print()

# 引数無しの場合、変換テーブルを生成
if len(args) >= 2:
    convert()
else:
    make_hira2bin_dic()